import { DynamicFormOption, LineType } from "../components/form/useDynamicForm";
import { ClassTypeEntity, FacilityEntity } from "../types/ActivityEntity";
import { ref } from "vue";
import http from "../http/request";

const hidClass = ref<Array<ClassTypeEntity>>([
  {
    id: "85708563472731003",
    parentId: "85708563472731001",
    name: "输电",
    level: 1,
    type: 1,
    ordinal: 1,
    children: [
      {
        id: "85708563472731006",
        parentId: "85708563472731003",
        name: "杆塔",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731011",
            parentId: "85708563472731006",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731013",
            parentId: "85708563472731006",
            name: "拉线变动",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731014",
            parentId: "85708563472731006",
            name: "违章搭挂",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731007",
        parentId: "85708563472731003",
        name: "基础",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731015",
            parentId: "85708563472731007",
            name: "人为取土",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离", "落差高度"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731018",
            parentId: "85708563472731007",
            name: "基面占用",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "基面占用面积"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731019",
            parentId: "85708563472731007",
            name: "腐蚀物质",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731130",
            parentId: "85708563472731007",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731008",
        parentId: "85708563472731003",
        name: "通道（导线）",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731020",
            parentId: "85708563472731008",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731021",
            parentId: "85708563472731008",
            name: "超高树竹",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "林权人",
              "林权人联系电话",
              "水平距离",
              "垂直距离",
              "林木棵树",
              "林权类型"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "签订青赔协议",
              "砍伐修剪",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731022",
            parentId: "85708563472731008",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731023",
            parentId: "85708563472731008",
            name: "易飘浮物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731024",
            parentId: "85708563472731008",
            name: "易燃易爆物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731025",
            parentId: "85708563472731008",
            name: "爆破作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "施工单位",
              "施工单位联系电话",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区爆破作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "爆破现场监护",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731026",
            parentId: "85708563472731008",
            name: "烧荒炼荒",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731027",
            parentId: "85708563472731008",
            name: "垂钓",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731009",
        parentId: "85708563472731003",
        name: "通道（电缆）",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731031",
            parentId: "85708563472731009",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731132",
            parentId: "85708563472731009",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731133",
            parentId: "85708563472731009",
            name: "通道占用",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      }
    ]
  },
  {
    id: "85708563472731004",
    parentId: "85708563472731001",
    name: "变电",
    level: 1,
    type: 1,
    ordinal: 1,
    children: [
      {
        id: "85708563472731032",
        parentId: "85708563472731004",
        name: "变电站",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731037",
            parentId: "85708563472731032",
            name: "易飘浮物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731038",
            parentId: "85708563472731032",
            name: "易燃易爆物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731042",
            parentId: "85708563472731032",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          }
        ]
      }
    ]
  },
  {
    id: "85708563472731005",
    parentId: "85708563472731001",
    name: "配电",
    level: 1,
    type: 1,
    ordinal: 1,
    children: [
      {
        id: "85708563472731033",
        parentId: "85708563472731005",
        name: "杆塔",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731050",
            parentId: "85708563472731033",
            name: "腐蚀物质",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731054",
            parentId: "85708563472731033",
            name: "拉线变动",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731134",
            parentId: "85708563472731033",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731135",
            parentId: "85708563472731033",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731034",
        parentId: "85708563472731005",
        name: "通道（导线）",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731058",
            parentId: "85708563472731034",
            name: "烧荒炼荒",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731062",
            parentId: "85708563472731034",
            name: "三线搭挂",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "建立联系群",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731063",
            parentId: "85708563472731034",
            name: "超高树竹",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "林权人",
              "林权人联系电话",
              "水平距离",
              "垂直距离",
              "林木棵树",
              "林权类型"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "签订青赔协议",
              "砍伐修剪",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731064",
            parentId: "85708563472731034",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731065",
            parentId: "85708563472731034",
            name: "爆破作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "施工单位",
              "施工单位联系电话",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区爆破作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "爆破现场监护",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731069",
            parentId: "85708563472731034",
            name: "易飘浮物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731070",
            parentId: "85708563472731034",
            name: "易燃易爆物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731140",
            parentId: "85708563472731034",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731035",
        parentId: "85708563472731005",
        name: "变压器",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731072",
            parentId: "85708563472731035",
            name: "超高树竹",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "林权人",
              "林权人联系电话",
              "水平距离",
              "垂直距离",
              "林木棵树",
              "林权类型"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "签订青赔协议",
              "砍伐修剪",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731073",
            parentId: "85708563472731035",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731074",
            parentId: "85708563472731035",
            name: "易飘浮物",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "协调整改",
              "提报政府相关职能部门",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731075",
            parentId: "85708563472731035",
            name: "爆破作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "施工单位",
              "施工单位联系电话",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区爆破作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "安装视频（图像）监控",
              "爆破现场监护",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731077",
            parentId: "85708563472731035",
            name: "设备偷盗",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "公安机关报案",
              "固定证据后及时修复",
              "装设警示与宣传标语",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731080",
            parentId: "85708563472731035",
            name: "违章搭挂",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话"],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731141",
            parentId: "85708563472731035",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      },
      {
        id: "85708563472731036",
        parentId: "85708563472731005",
        name: "通道（电缆）",
        level: 2,
        type: 1,
        ordinal: 1,
        children: [
          {
            id: "85708563472731086",
            parentId: "85708563472731036",
            name: "违章搭建",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "水平距离",
              "垂直距离",
              "作业许可"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报“两违办”",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731142",
            parentId: "85708563472731036",
            name: "施工作业",
            level: 3,
            type: 1,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话",
              "作业许可",
              "水平距离",
              "垂直距离"
            ],
            checkboxOptions: [
              "查找责任人",
              "签发安全隐患告知书",
              "要求办理保护区作业申请",
              "签订安全协议书",
              "安全技术交底",
              "建立联系群",
              "定期发送安全提醒信息",
              "装设警示标志",
              "装设限高装置",
              "安装视频（图像）监控",
              "协调整改",
              "提报电力执法机构"
            ]
          }
        ]
      }
    ]
  }
]);

const exterClass = ref<Array<ClassTypeEntity>>([
  {
    id: "85708563472731087",
    parentId: "85708563472731002",
    name: "输电",
    level: 1,
    type: 2,
    ordinal: 1,
    children: [
      {
        id: "85708563472731090",
        parentId: "85708563472731087",
        name: "杆塔",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731098",
            parentId: "85708563472731090",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731099",
            parentId: "85708563472731090",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          }
        ]
      },
      {
        id: "85708563472731091",
        parentId: "85708563472731087",
        name: "通道（导线）",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731100",
            parentId: "85708563472731091",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731101",
            parentId: "85708563472731091",
            name: "树竹砍伐",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731102",
            parentId: "85708563472731091",
            name: "违章搭建",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报“两违办”",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731103",
            parentId: "85708563472731091",
            name: "爆破作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731104",
            parentId: "85708563472731091",
            name: "烧荒炼荒",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731105",
            parentId: "85708563472731091",
            name: "垂钓",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731124",
            parentId: "85708563472731091",
            name: "易漂浮物",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          }
        ]
      },
      {
        id: "85708563472731092",
        parentId: "85708563472731087",
        name: "通道（电缆）",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731106",
            parentId: "85708563472731092",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731125",
            parentId: "85708563472731092",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          }
        ]
      }
    ]
  },
  {
    id: "85708563472731088",
    parentId: "85708563472731002",
    name: "变电",
    level: 1,
    type: 2,
    ordinal: 1,
    children: [
      {
        id: "85708563472731093",
        parentId: "85708563472731088",
        name: "变电站",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731107",
            parentId: "85708563472731093",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731108",
            parentId: "85708563472731093",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          },
          {
            id: "85708563472731126",
            parentId: "85708563472731093",
            name: "易漂浮物",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          }
        ]
      }
    ]
  },
  {
    id: "85708563472731089",
    parentId: "85708563472731002",
    name: "配电",
    level: 1,
    type: 2,
    ordinal: 1,
    children: [
      {
        id: "85708563472731094",
        parentId: "85708563472731089",
        name: "杆塔",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731109",
            parentId: "85708563472731094",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔",
              "提报电力执法机构"
            ]
          },
          {
            id: "85708563472731110",
            parentId: "85708563472731094",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731111",
            parentId: "85708563472731094",
            name: "违章搭挂",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "追回经济赔偿金",
              "肇事方登报检讨"
            ]
          }
        ]
      },
      {
        id: "85708563472731095",
        parentId: "85708563472731089",
        name: "通道（导线）",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731112",
            parentId: "85708563472731095",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731113",
            parentId: "85708563472731095",
            name: "树竹砍伐",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731114",
            parentId: "85708563472731095",
            name: "违章搭建",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报“两违办”",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731115",
            parentId: "85708563472731095",
            name: "爆破作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731116",
            parentId: "85708563472731095",
            name: "烧荒炼荒",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731117",
            parentId: "85708563472731095",
            name: "垂钓",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731127",
            parentId: "85708563472731095",
            name: "易漂浮物",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["业主单位", "业主联系电话", "水平距离"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          }
        ]
      },
      {
        id: "85708563472731096",
        parentId: "85708563472731089",
        name: "变压器",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731118",
            parentId: "85708563472731096",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731119",
            parentId: "85708563472731096",
            name: "超高树竹",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "林权人",
              "林权人联系电话",
              "水平距离",
              "垂直距离",
              "林木棵树",
              "林权类型"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731120",
            parentId: "85708563472731096",
            name: "违章搭建",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报“两违办”",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731121",
            parentId: "85708563472731096",
            name: "设备偷盗",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731122",
            parentId: "85708563472731096",
            name: "违章搭挂",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731128",
            parentId: "85708563472731096",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "申报保险理赔"
            ]
          }
        ]
      },
      {
        id: "85708563472731097",
        parentId: "85708563472731089",
        name: "通道（电缆）",
        level: 2,
        type: 2,
        ordinal: 1,
        children: [
          {
            id: "85708563472731123",
            parentId: "85708563472731097",
            name: "施工作业",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: [
              "业主单位",
              "业主联系电话",
              "施工单位",
              "施工单位联系电话"
            ],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "申报保险理赔"
            ]
          },
          {
            id: "85708563472731129",
            parentId: "85708563472731097",
            name: "外力破坏",
            level: 3,
            type: 2,
            ordinal: 1,
            children: null,
            formOptions: ["肇事单位（人）", "肇事方联系电话"],
            checkboxOptions: [
              "反馈调控部门",
              "提报公安机关",
              "提报电力执法机构",
              "查找责任人",
              "现场拍照留证",
              "组织抢修",
              "中止施工用电",
              "申报保险理赔"
            ]
          }
        ]
      }
    ]
  }
]);
export function getHidClass(): Array<ClassTypeEntity> {
  // const res = await http<[]>({
  //   method: "get",
  //   url: "system/structure/class/query/all/hid",
  //   data: {}
  // });
  // console.log(res);
  // if (res.success) {
  //   hidClass.value = res.data;
  // }
  setLastChildrenAndToMap(hidClass.value, LineType.HID);
  return hidClass.value;
  // console.log("隐患类型", hidTypes.value);
}

export function getExterClass(): Array<ClassTypeEntity> {
  setLastChildrenAndToMap(exterClass.value, LineType.EXTER);
  return exterClass.value;
}

//所有字典
export const allDict = ref({
  specialty: [
    {
      value: 1,
      text: "输电",
      label: "输电",
      title: "输电"
    },
    {
      value: 2,
      text: "变电",
      label: "变电",
      title: "变电"
    },
    {
      value: 3,
      text: "配电",
      label: "配电",
      title: "配电"
    },
    {
      value: 4,
      text: "发电",
      label: "发电",
      title: "发电"
    }
  ],
  important_news_tag: [
    {
      value: 1,
      text: "新闻动态",
      label: "新闻动态",
      title: "新闻动态"
    },
    {
      value: 2,
      text: "普法动态",
      label: "普法动态",
      title: "普法动态"
    },
    {
      value: 3,
      text: "普政府信息",
      label: "普政府信息",
      title: "普政府信息"
    }
  ],
  notice_state: [
    {
      value: 1,
      text: "发布中",
      label: "发布中",
      title: "发布中"
    },
    {
      value: 0,
      text: "未发布",
      label: "未发布",
      title: "未发布"
    },
    {
      value: 2,
      text: "已撤销",
      label: "已撤销",
      title: "已撤销"
    }
  ],
  hidden_trouble_type: [
    {
      value: 1,
      text: "线树",
      label: "线树",
      title: "线树"
    },
    {
      value: 2,
      text: "线房",
      label: "线房",
      title: "线房"
    },
    {
      value: 3,
      text: "施工外破",
      label: "施工外破",
      title: "施工外破"
    },
    {
      value: 4,
      text: "漂浮物",
      label: "漂浮物",
      title: "漂浮物"
    },
    {
      value: 5,
      text: "堆积杂物",
      label: "堆积杂物",
      title: "堆积杂物"
    },
    {
      value: 6,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  operation_type: [
    {
      value: 0,
      text: "其它",
      label: "其它",
      title: "其它"
    },
    {
      value: 1,
      text: "查询",
      label: "查询",
      title: "查询"
    },
    {
      value: 2,
      text: "新增",
      label: "新增",
      title: "新增"
    },
    {
      value: 3,
      text: "修改",
      label: "修改",
      title: "修改"
    },
    {
      value: 4,
      text: "删除",
      label: "删除",
      title: "删除"
    },
    {
      value: 5,
      text: "授权",
      label: "授权",
      title: "授权"
    },
    {
      value: 6,
      text: "导出",
      label: "导出",
      title: "导出"
    },
    {
      value: 7,
      text: "导入",
      label: "导入",
      title: "导入"
    },
    {
      value: 8,
      text: "强退",
      label: "强退",
      title: "强退"
    },
    {
      value: 9,
      text: "清空",
      label: "清空",
      title: "清空"
    },
    {
      value: 10,
      text: "提交",
      label: "提交",
      title: "提交"
    },
    {
      value: 11,
      text: "拒绝",
      label: "拒绝",
      title: "拒绝"
    },
    {
      value: 12,
      text: "审核",
      label: "审核",
      title: "审核"
    },
    {
      value: 13,
      text: "生成",
      label: "生成",
      title: "生成"
    },
    {
      value: 14,
      text: "发布",
      label: "发布",
      title: "发布"
    },
    {
      value: 15,
      text: "采集",
      label: "采集",
      title: "采集"
    }
  ],
  is_enable: [
    {
      value: 1,
      text: "启用",
      label: "启用",
      title: "启用"
    },
    {
      value: 0,
      text: "禁用",
      label: "禁用",
      title: "禁用"
    }
  ],
  material_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "待审核",
      label: "待审核",
      title: "待审核"
    },
    {
      value: 3,
      text: "未通过",
      label: "未通过",
      title: "未通过"
    },
    {
      value: 4,
      text: "已通过",
      label: "已通过",
      title: "已通过"
    },
    {
      value: 5,
      text: "提报中",
      label: "提报中",
      title: "提报中"
    },
    {
      value: 6,
      text: "采集中",
      label: "采集中",
      title: "采集中"
    },
    {
      value: 7,
      text: "已提报",
      label: "已提报",
      title: "已提报"
    },
    {
      value: 8,
      text: "已采集",
      label: "已采集",
      title: "已采集"
    }
  ],
  person_education: [
    {
      value: 1,
      text: "博士",
      label: "博士",
      title: "博士"
    },
    {
      value: 2,
      text: "硕士",
      label: "硕士",
      title: "硕士"
    },
    {
      value: 3,
      text: "大学本科",
      label: "大学本科",
      title: "大学本科"
    },
    {
      value: 4,
      text: "大学专科",
      label: "大学专科",
      title: "大学专科"
    },
    {
      value: 5,
      text: "高中",
      label: "高中",
      title: "高中"
    },
    {
      value: 6,
      text: "初中",
      label: "初中",
      title: "初中"
    },
    {
      value: 7,
      text: "小学",
      label: "小学",
      title: "小学"
    },
    {
      value: 8,
      text: "其它",
      label: "其它",
      title: "其它"
    }
  ],
  external_dispose_way: [
    {
      value: 1,
      text: "现场协调",
      label: "现场协调",
      title: "现场协调"
    },
    {
      value: 2,
      text: "向公安报案",
      label: "向公安报案",
      title: "向公安报案"
    },
    {
      value: 3,
      text: "行政立案",
      label: "行政立案",
      title: "行政立案"
    }
  ],
  device_type: [
    {
      value: 1,
      text: "导线",
      label: "导线",
      title: "导线"
    },
    {
      value: 2,
      text: "电缆",
      label: "电缆",
      title: "电缆"
    },
    {
      value: 3,
      text: "杆塔",
      label: "杆塔",
      title: "杆塔"
    },
    {
      value: 4,
      text: "变电站",
      label: "变电站",
      title: "变电站"
    },
    {
      value: 5,
      text: "发电厂",
      label: "发电厂",
      title: "发电厂"
    },
    {
      value: 6,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  forest_type: [
    {
      value: 1,
      text: "个人",
      label: "个人",
      title: "个人"
    },
    {
      value: 2,
      text: "集体",
      label: "集体",
      title: "集体"
    },
    {
      value: 3,
      text: "国有",
      label: "国有",
      title: "国有"
    },
    {
      value: 4,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  source: [
    {
      value: 1,
      text: "举报人录入",
      label: "举报人录入",
      title: "举报人录入"
    },
    {
      value: 2,
      text: "电话举报",
      label: "电话举报",
      title: "电话举报"
    },
    {
      value: 3,
      text: "其他平台转办",
      label: "其他平台转办",
      title: "其他平台转办"
    },
    {
      value: 4,
      text: "电力企业自主提报",
      label: "电力企业自主提报",
      title: "电力企业自主提报"
    }
  ],
  material_collect_status: [],
  meeting_user_data_code: [
    {
      value: 1,
      text: "按时提交",
      label: "按时提交",
      title: "按时提交"
    },
    {
      value: 2,
      text: "超时提交",
      label: "超时提交",
      title: "超时提交"
    },
    {
      value: 3,
      text: "未提交",
      label: "未提交",
      title: "未提交"
    }
  ],
  install_type: [
    {
      value: 1,
      text: "自立式安装",
      label: "自立式安装",
      title: "自立式安装"
    },
    {
      value: 2,
      text: "悬挂式安装",
      label: "悬挂式安装",
      title: "悬挂式安装"
    },
    {
      value: 3,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  agree_disagree: [
    {
      value: 1,
      text: "同意",
      label: "同意",
      title: "同意"
    },
    {
      value: 0,
      text: "不同意",
      label: "不同意",
      title: "不同意"
    }
  ],
  person_nature: [
    {
      value: 1,
      text: "主业",
      label: "主业",
      title: "主业"
    },
    {
      value: 0,
      text: "外协",
      label: "外协",
      title: "外协"
    }
  ],
  notice_type: [
    {
      value: 2,
      text: "隐患",
      label: "隐患",
      title: "隐患"
    },
    {
      value: 1,
      text: "外破",
      label: "外破",
      title: "外破"
    },
    {
      value: 3,
      text: "举报",
      label: "举报",
      title: "举报"
    },
    {
      value: 4,
      text: "保护区",
      label: "保护区",
      title: "保护区"
    },
    {
      value: 5,
      text: "会议",
      label: "会议",
      title: "会议"
    },
    {
      value: 6,
      text: "互动交流",
      label: "互动交流",
      title: "互动交流"
    }
  ],
  person_political: [
    {
      value: 1,
      text: "中共党员",
      label: "中共党员",
      title: "中共党员"
    },
    {
      value: 2,
      text: "民主党派",
      label: "民主党派",
      title: "民主党派"
    },
    {
      value: 3,
      text: "共青团员",
      label: "共青团员",
      title: "共青团员"
    },
    {
      value: 4,
      text: "群众",
      label: "群众",
      title: "群众"
    }
  ],
  character: [
    {
      value: 1,
      text: "主业",
      label: "主业",
      title: "主业"
    },
    {
      value: 0,
      text: "外协",
      label: "外协",
      title: "外协"
    }
  ],
  dynamic_type: [
    {
      value: 1,
      text: "现场宣传",
      label: "现场宣传",
      title: "现场宣传"
    },
    {
      value: 2,
      text: "媒体宣传",
      label: "媒体宣传",
      title: "媒体宣传"
    },
    {
      value: 3,
      text: "现场+媒体宣传",
      label: "现场+媒体宣传",
      title: "现场+媒体宣传"
    },
    {
      value: 4,
      text: "普法文章",
      label: "普法文章",
      title: "普法文章"
    }
  ],
  yes_no_rectification: [
    {
      value: 0,
      text: "已整改",
      label: "已整改",
      title: "已整改"
    },
    {
      value: 1,
      text: "未整改",
      label: "未整改",
      title: "未整改"
    }
  ],
  coercive: [
    {
      value: 1,
      text: "通知电力企业采取停电措施",
      label: "通知电力企业采取停电措施",
      title: "通知电力企业采取停电措施"
    },
    {
      value: 2,
      text: "采取联合执法措施",
      label: "采取联合执法措施",
      title: "采取联合执法措施"
    },
    {
      value: 3,
      text: "采取应急处置措施",
      label: "采取应急处置措施",
      title: "采取应急处置措施"
    },
    {
      value: 4,
      text: "采取其他强制措施",
      label: "采取其他强制措施",
      title: "采取其他强制措施"
    }
  ],
  check_plan_type: [
    {
      value: 1,
      text: "抽检次数最少",
      label: "抽检次数最少",
      title: "抽检次数最少"
    },
    {
      value: 2,
      text: "抽检合格率最低",
      label: "抽检合格率最低",
      title: "抽检合格率最低"
    },
    {
      value: 3,
      text: "三个月未抽检",
      label: "三个月未抽检",
      title: "三个月未抽检"
    }
  ],
  important_news_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "审核中",
      label: "审核中",
      title: "审核中"
    },
    {
      value: 3,
      text: "驳回",
      label: "驳回",
      title: "驳回"
    },
    {
      value: 4,
      text: "作废",
      label: "作废",
      title: "作废"
    },
    {
      value: 5,
      text: "已完成",
      label: "已完成",
      title: "已完成"
    }
  ],
  important_news_externalInfo_type: [
    {
      value: 1,
      text: "政府",
      label: "政府",
      title: "政府"
    },
    {
      value: 2,
      text: "企业",
      label: "企业",
      title: "企业"
    },
    {
      value: 3,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  yes_no: [
    {
      value: 1,
      text: "是",
      label: "是",
      title: "是"
    },
    {
      value: 0,
      text: "否",
      label: "否",
      title: "否"
    }
  ],
  formulate_type: [
    {
      value: 1,
      text: "系统推送",
      label: "系统推送",
      title: "系统推送"
    },
    {
      value: 2,
      text: "执法办负责人",
      label: "执法办负责人",
      title: "执法办负责人"
    }
  ],
  news_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "审核中",
      label: "审核中",
      title: "审核中"
    },
    {
      value: 3,
      text: "未通过",
      label: "未通过",
      title: "未通过"
    },
    {
      value: 4,
      text: "已通过",
      label: "已通过",
      title: "已通过"
    }
  ],
  publicity_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "审核中",
      label: "审核中",
      title: "审核中"
    },
    {
      value: 3,
      text: "未通过",
      label: "未通过",
      title: "未通过"
    },
    {
      value: 4,
      text: "已通过",
      label: "已通过",
      title: "已通过"
    },
    {
      value: 5,
      text: "提报中",
      label: "提报中",
      title: "提报中"
    },
    {
      value: 6,
      text: "采集中",
      label: "采集中",
      title: "采集中"
    },
    {
      value: 7,
      text: "已提报",
      label: "已提报",
      title: "已提报"
    },
    {
      value: 8,
      text: "已采集",
      label: "已采集",
      title: "已采集"
    },
    {
      value: 9,
      text: "提报未通过",
      label: "提报未通过",
      title: "提报未通过"
    },
    {
      value: 10,
      text: "采集未通过",
      label: "采集未通过",
      title: "采集未通过"
    }
  ],
  protect_process: [
    {
      value: 1,
      text: "电力设施产权人提报",
      label: "电力设施产权人提报",
      title: "电力设施产权人提报"
    },
    {
      value: 2,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 3,
      text: "完结",
      label: "完结",
      title: "完结"
    }
  ],
  login_status: [
    {
      value: 0,
      text: "成功",
      label: "成功",
      title: "成功"
    },
    {
      value: 1,
      text: "失败",
      label: "失败",
      title: "失败"
    }
  ],
  protect_plan_process: [
    {
      value: 1,
      text: "执法办经办提报",
      label: "执法办经办提报",
      title: "执法办经办提报"
    },
    {
      value: 2,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 3,
      text: "完结",
      label: "完结",
      title: "完结"
    }
  ],
  interact_status: [
    {
      value: 0,
      text: "待办",
      label: "待办",
      title: "待办"
    },
    {
      value: 1,
      text: "已办",
      label: "已办",
      title: "已办"
    }
  ],
  certificate_statue: [
    {
      value: 1,
      text: "有效",
      label: "有效",
      title: "有效"
    },
    {
      value: 2,
      text: "暂停",
      label: "暂停",
      title: "暂停"
    },
    {
      value: 3,
      text: "撤销",
      label: "撤销",
      title: "撤销"
    },
    {
      value: 4,
      text: "注销",
      label: "注销",
      title: "注销"
    },
    {
      value: 5,
      text: "过期",
      label: "过期",
      title: "过期"
    }
  ],
  dynamic_recommend_status: [],
  punish_way: [
    {
      value: 1,
      text: "罚款",
      label: "罚款",
      title: "罚款"
    },
    {
      value: 2,
      text: "警告",
      label: "警告",
      title: "警告"
    },
    {
      value: 3,
      text: "通报批评",
      label: "通报批评",
      title: "通报批评"
    },
    {
      value: 4,
      text: "没收非法财务",
      label: "没收非法财务",
      title: "没收非法财务"
    },
    {
      value: 5,
      text: "没收违法所得",
      label: "没收违法所得",
      title: "没收违法所得"
    }
  ],
  material_publicity_type: [
    {
      value: 1,
      text: "展板",
      label: "展板",
      title: "展板"
    },
    {
      value: 2,
      text: "海报",
      label: "海报",
      title: "海报"
    },
    {
      value: 3,
      text: "小册",
      label: "小册",
      title: "小册"
    },
    {
      value: 4,
      text: "宣传单",
      label: "宣传单",
      title: "宣传单"
    },
    {
      value: 5,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  hidden_trouble_dispose_way: [
    {
      value: 1,
      text: "现场协调",
      label: "现场协调",
      title: "现场协调"
    },
    {
      value: 2,
      text: "约谈",
      label: "约谈",
      title: "约谈"
    },
    {
      value: 3,
      text: "采取强制措施",
      label: "采取强制措施",
      title: "采取强制措施"
    },
    {
      value: 4,
      text: "其他方式",
      label: "其他方式",
      title: "其他方式"
    }
  ],
  status: [
    {
      value: 1,
      text: "启用",
      label: "启用",
      title: "启用"
    },
    {
      value: 0,
      text: "停用",
      label: "停用",
      title: "停用"
    }
  ],
  protect_check_statue: [
    {
      value: 1,
      text: "正确",
      label: "正确",
      title: "正确"
    },
    {
      value: 0,
      text: "不正确",
      label: "不正确",
      title: "不正确"
    }
  ],
  rectification_inventory: [
    {
      value: 1,
      text: "电力设施产权人整改提报",
      label: "电力设施产权人整改提报",
      title: "电力设施产权人整改提报"
    },
    {
      value: 2,
      text: "执法办经办复检",
      label: "执法办经办复检",
      title: "执法办经办复检"
    },
    {
      value: 3,
      text: "完结",
      label: "完结",
      title: "完结"
    }
  ],
  dynamic_media_type: [
    {
      value: 1,
      text: "网站",
      label: "网站",
      title: "网站"
    },
    {
      value: 2,
      text: "微信微博等自媒体",
      label: "微信微博等自媒体",
      title: "微信微博等自媒体"
    },
    {
      value: 3,
      text: "电视",
      label: "电视",
      title: "电视"
    },
    {
      value: 4,
      text: "报纸",
      label: "报纸",
      title: "报纸"
    },
    {
      value: 5,
      text: "广播电台",
      label: "广播电台",
      title: "广播电台"
    },
    {
      value: 6,
      text: "车载广告",
      label: "车载广告",
      title: "车载广告"
    },
    {
      value: 7,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  dynamic_media_level: [
    {
      value: 1,
      text: "县级",
      label: "县级",
      title: "县级"
    },
    {
      value: 2,
      text: "市级",
      label: "市级",
      title: "市级"
    },
    {
      value: 3,
      text: "省级",
      label: "省级",
      title: "省级"
    },
    {
      value: 4,
      text: "国家级",
      label: "国家级",
      title: "国家级"
    }
  ],
  person_speciality: [
    {
      value: 1,
      text: "变电",
      label: "变电",
      title: "变电"
    },
    {
      value: 2,
      text: "输电",
      label: "输电",
      title: "输电"
    },
    {
      value: 3,
      text: "配电",
      label: "配电",
      title: "配电"
    },
    {
      value: 4,
      text: "营销",
      label: "营销",
      title: "营销"
    },
    {
      value: 5,
      text: "后勤",
      label: "后勤",
      title: "后勤"
    },
    {
      value: 6,
      text: "调度",
      label: "调度",
      title: "调度"
    },
    {
      value: 7,
      text: "通信",
      label: "通信",
      title: "通信"
    },
    {
      value: 8,
      text: "法律",
      label: "法律",
      title: "法律"
    },
    {
      value: 9,
      text: "其它",
      label: "其它",
      title: "其它"
    }
  ],
  meeting_status: [
    {
      value: 1,
      text: "未执行",
      label: "未执行",
      title: "未执行"
    },
    {
      value: 2,
      text: "执行中",
      label: "执行中",
      title: "执行中"
    },
    {
      value: 3,
      text: "已执行",
      label: "已执行",
      title: "已执行"
    },
    {
      value: 4,
      text: "已取消",
      label: "已取消",
      title: "已取消"
    }
  ],
  gender: [
    {
      value: 1,
      text: "男",
      label: "男",
      title: "男"
    },
    {
      value: 0,
      text: "女",
      label: "女",
      title: "女"
    }
  ],
  dynamic_status: [],
  report_dispose_way: [
    {
      value: 1,
      text: "隐患",
      label: "隐患",
      title: "隐患"
    },
    {
      value: 2,
      text: "外破",
      label: "外破",
      title: "外破"
    }
  ],
  interact_type: [
    {
      value: 1,
      text: "在线咨询",
      label: "在线咨询",
      title: "在线咨询"
    },
    {
      value: 2,
      text: "法律咨询",
      label: "法律咨询",
      title: "法律咨询"
    }
  ],
  delimit_status: [
    {
      value: 1,
      text: "未划定",
      label: "未划定",
      title: "未划定"
    },
    {
      value: 2,
      text: "已划定待标示",
      label: "已划定待标示",
      title: "已划定待标示"
    },
    {
      value: 3,
      text: "已划定已标示",
      label: "已划定已标示",
      title: "已划定已标示"
    },
    {
      value: 4,
      text: "拒绝审批",
      label: "拒绝审批",
      title: "拒绝审批"
    }
  ],
  system_org_type: [
    {
      value: 1,
      text: "本部",
      label: "本部",
      title: "本部"
    },
    {
      value: 2,
      text: "外部",
      label: "外部",
      title: "外部"
    }
  ],
  report_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "举报人录入",
      label: "举报人录入",
      title: "举报人录入"
    },
    {
      value: 3,
      text: "执法办经办审核",
      label: "执法办经办审核",
      title: "执法办经办审核"
    },
    {
      value: 4,
      text: "电力设施产权人核实",
      label: "电力设施产权人核实",
      title: "电力设施产权人核实"
    },
    {
      value: 5,
      text: "电力设施产权人反馈",
      label: "电力设施产权人反馈",
      title: "电力设施产权人反馈"
    },
    {
      value: 6,
      text: "归档",
      label: "归档",
      title: "归档"
    },
    {
      value: 7,
      text: "已办理",
      label: "已办理",
      title: "已办理"
    },
    {
      value: 8,
      text: "不受理",
      label: "不受理",
      title: "不受理"
    }
  ],
  meeting_data_code: [
    {
      value: 1,
      text: "未完成上传",
      label: "未完成上传",
      title: "未完成上传"
    },
    {
      value: 2,
      text: "已完成上传",
      label: "已完成上传",
      title: "已完成上传"
    }
  ],
  hidden_trouble_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "电力设施产权人提报",
      label: "电力设施产权人提报",
      title: "电力设施产权人提报"
    },
    {
      value: 3,
      text: "执法办经办审核",
      label: "执法办经办审核",
      title: "执法办经办审核"
    },
    {
      value: 4,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 5,
      text: "执法办经办处置",
      label: "执法办经办处置",
      title: "执法办经办处置"
    },
    {
      value: 6,
      text: "电力设施产权人核实",
      label: "电力设施产权人核实",
      title: "电力设施产权人核实"
    },
    {
      value: 7,
      text: "归档",
      label: "归档",
      title: "归档"
    }
  ],
  material_type: [
    {
      value: 1,
      text: "历史案例",
      label: "历史案例",
      title: "历史案例"
    },
    {
      value: 2,
      text: "宣传片",
      label: "宣传片",
      title: "宣传片"
    },
    {
      value: 3,
      text: "课件/PPT",
      label: "课件/PPT",
      title: "课件/PPT"
    },
    {
      value: 4,
      text: "宣传品",
      label: "宣传品",
      title: "宣传品"
    }
  ],
  solve_unsolved: [
    {
      value: 1,
      text: "已解决",
      label: "已解决",
      title: "已解决"
    },
    {
      value: 0,
      text: "未解决",
      label: "未解决",
      title: "未解决"
    }
  ],
  vip_type: [
    {
      value: 1,
      text: "核电线路",
      label: "核电线路",
      title: "核电线路"
    },
    {
      value: 2,
      text: "高速铁路牵引站",
      label: "高速铁路牵引站",
      title: "高速铁路牵引站"
    },
    {
      value: 3,
      text: "地铁",
      label: "地铁",
      title: "地铁"
    },
    {
      value: 4,
      text: "机场",
      label: "机场",
      title: "机场"
    },
    {
      value: 5,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  material_recommend_status: [],
  dynamic_status_act_review: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 3,
      text: "执法办经办提报",
      label: "执法办经办提报",
      title: "执法办经办提报"
    },
    {
      value: 4,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 5,
      text: "未通过",
      label: "未通过",
      title: "未通过"
    },
    {
      value: 6,
      text: "已通过",
      label: "已通过",
      title: "已通过"
    }
  ],
  rectification_library: [
    {
      value: 1,
      text: "执法办经办提报",
      label: "执法办经办提报",
      title: "执法办经办提报"
    },
    {
      value: 2,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 3,
      text: "完结",
      label: "完结",
      title: "完结"
    }
  ],
  dispose_result: [
    {
      value: 1,
      text: "避免设备损坏",
      label: "避免设备损坏",
      title: "避免设备损坏"
    },
    {
      value: 2,
      text: "避免人身伤亡",
      label: "避免人身伤亡",
      title: "避免人身伤亡"
    },
    {
      value: 3,
      text: "避免线路跳闸",
      label: "避免线路跳闸",
      title: "避免线路跳闸"
    },
    {
      value: 4,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  pass_fail: [
    {
      value: 1,
      text: "合格",
      label: "合格",
      title: "合格"
    },
    {
      value: 0,
      text: "不合格",
      label: "不合格",
      title: "不合格"
    }
  ],
  dynamic_collect_status: [],
  material_case_type: [
    {
      value: 1,
      text: "隐患事件",
      label: "隐患事件",
      title: "隐患事件"
    },
    {
      value: 2,
      text: "外破事件",
      label: "外破事件",
      title: "外破事件"
    },
    {
      value: 3,
      text: "举报事件",
      label: "举报事件",
      title: "举报事件"
    }
  ],
  task_status: [
    {
      value: 1,
      text: "未执行",
      label: "未执行",
      title: "未执行"
    },
    {
      value: 2,
      text: "执行中",
      label: "执行中",
      title: "执行中"
    },
    {
      value: 3,
      text: "已完成",
      label: "已完成",
      title: "已完成"
    }
  ],
  execute_status: [
    {
      value: 1,
      text: "未执行",
      label: "未执行",
      title: "未执行"
    },
    {
      value: 2,
      text: "执行中",
      label: "执行中",
      title: "执行中"
    },
    {
      value: 3,
      text: "已完成",
      label: "已完成",
      title: "已完成"
    }
  ],
  meeting_type: [
    {
      value: 1,
      text: "年度工作会议",
      label: "年度工作会议",
      title: "年度工作会议"
    },
    {
      value: 2,
      text: "月度工作会议",
      label: "月度工作会议",
      title: "月度工作会议"
    },
    {
      value: 3,
      text: "周工作会议",
      label: "周工作会议",
      title: "周工作会议"
    }
  ],
  protection_type: [
    {
      value: 1,
      text: "架空电力线路",
      label: "架空电力线路",
      title: "架空电力线路"
    },
    {
      value: 2,
      text: "电力电缆线路",
      label: "电力电缆线路",
      title: "电力电缆线路"
    },
    {
      value: 3,
      text: "发电设施附属管线",
      label: "发电设施附属管线",
      title: "发电设施附属管线"
    },
    {
      value: 4,
      text: "架空电缆混合",
      label: "架空电缆混合",
      title: "架空电缆混合"
    }
  ],
  regulation_type: [
    {
      value: 1,
      text: "国家法律",
      label: "国家法律",
      title: "国家法律"
    },
    {
      value: 2,
      text: "行政法规",
      label: "行政法规",
      title: "行政法规"
    },
    {
      value: 3,
      text: "司法解释",
      label: "司法解释",
      title: "司法解释"
    },
    {
      value: 4,
      text: "部门规章",
      label: "部门规章",
      title: "部门规章"
    },
    {
      value: 5,
      text: "地方性法规",
      label: "地方性法规",
      title: "地方性法规"
    },
    {
      value: 6,
      text: "地方性政府规章",
      label: "地方性政府规章",
      title: "地方性政府规章"
    },
    {
      value: 7,
      text: "规范性文件",
      label: "规范性文件",
      title: "规范性文件"
    }
  ],
  external_type: [
    {
      value: 1,
      text: "施工外破",
      label: "施工外破",
      title: "施工外破"
    },
    {
      value: 2,
      text: "线树",
      label: "线树",
      title: "线树"
    },
    {
      value: 3,
      text: "交通事故",
      label: "交通事故",
      title: "交通事故"
    },
    {
      value: 4,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  external_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "电力设施产权人提报",
      label: "电力设施产权人提报",
      title: "电力设施产权人提报"
    },
    {
      value: 3,
      text: "执法办经办审核",
      label: "执法办经办审核",
      title: "执法办经办审核"
    },
    {
      value: 4,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 5,
      text: "执法办经办处置",
      label: "执法办经办处置",
      title: "执法办经办处置"
    },
    {
      value: 6,
      text: "行政立案申请",
      label: "行政立案申请",
      title: "行政立案申请"
    },
    {
      value: 7,
      text: "行政立案调查",
      label: "行政立案调查",
      title: "行政立案调查"
    },
    {
      value: 8,
      text: "行政立案处罚",
      label: "行政立案处罚",
      title: "行政立案处罚"
    },
    {
      value: 9,
      text: "行政立案结案",
      label: "行政立案结案",
      title: "行政立案结案"
    },
    {
      value: 10,
      text: "电力设施产权人处置",
      label: "电力设施产权人处置",
      title: "电力设施产权人处置"
    },
    {
      value: 11,
      text: "归档",
      label: "归档",
      title: "归档"
    },
    {
      value: 12,
      text: "公安受理反馈",
      label: "公安受理反馈",
      title: "公安受理反馈"
    }
  ],
  check_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 3,
      text: "执法办经办提报",
      label: "执法办经办提报",
      title: "执法办经办提报"
    },
    {
      value: 4,
      text: "抽检完成",
      label: "抽检完成",
      title: "抽检完成"
    },
    {
      value: 0,
      text: "系统生成",
      label: "系统生成",
      title: "系统生成"
    }
  ],
  important_news_source_type: [
    {
      value: 1,
      text: "提报录入",
      label: "提报录入",
      title: "提报录入"
    },
    {
      value: 2,
      text: "采集录入",
      label: "采集录入",
      title: "采集录入"
    }
  ],
  interact_process: [
    {
      value: 1,
      text: "咨询",
      label: "咨询",
      title: "咨询"
    },
    {
      value: 2,
      text: "执法办经办答复",
      label: "执法办经办答复",
      title: "执法办经办答复"
    },
    {
      value: 4,
      text: "执法办负责人审核",
      label: "执法办负责人审核",
      title: "执法办负责人审核"
    },
    {
      value: 5,
      text: "完结",
      label: "完结",
      title: "完结"
    },
    {
      value: 3,
      text: "律师答复",
      label: "律师答复",
      title: "律师答复"
    }
  ],
  hidden_trouble_level: [
    {
      value: 1,
      text: "一般",
      label: "一般",
      title: "一般"
    },
    {
      value: 2,
      text: "重大",
      label: "重大",
      title: "重大"
    }
  ],
  dynamic_workplace: [
    {
      value: 1,
      text: "工地",
      label: "工地",
      title: "工地"
    },
    {
      value: 2,
      text: "学校",
      label: "学校",
      title: "学校"
    },
    {
      value: 3,
      text: "乡村",
      label: "乡村",
      title: "乡村"
    },
    {
      value: 4,
      text: "企业",
      label: "企业",
      title: "企业"
    },
    {
      value: 5,
      text: "公共场所",
      label: "公共场所",
      title: "公共场所"
    },
    {
      value: 6,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  meeting_mode: [
    {
      value: 1,
      text: "线下",
      label: "线下",
      title: "线下"
    },
    {
      value: 2,
      text: "线上",
      label: "线上",
      title: "线上"
    }
  ],
  interact_condition: [
    {
      value: 1,
      text: "我的",
      label: "我的",
      title: "我的"
    },
    {
      value: 2,
      text: "提出",
      label: "提出",
      title: "提出"
    },
    {
      value: 3,
      text: "答复",
      label: "答复",
      title: "答复"
    }
  ],
  enter_type: [
    {
      value: 1,
      text: "电网企业",
      label: "电网企业",
      title: "电网企业"
    },
    {
      value: 2,
      text: "发电企业",
      label: "发电企业",
      title: "发电企业"
    },
    {
      value: 3,
      text: "其他",
      label: "其他",
      title: "其他"
    }
  ],
  material_new_status: [
    {
      value: 1,
      text: "草稿",
      label: "草稿",
      title: "草稿"
    },
    {
      value: 2,
      text: "审核中",
      label: "审核中",
      title: "审核中"
    },
    {
      value: 3,
      text: "驳回",
      label: "驳回",
      title: "驳回"
    },
    {
      value: 4,
      text: "已取消",
      label: "已取消",
      title: "已取消"
    },
    {
      value: 5,
      text: "已完成",
      label: "已完成",
      title: "已完成"
    }
  ],
  meeting_summary_code: [
    {
      value: 1,
      text: "上传纪要",
      label: "上传纪要",
      title: "上传纪要"
    },
    {
      value: 2,
      text: "查看纪要",
      label: "查看纪要",
      title: "查看纪要"
    }
  ],
  hidden_trouble_voltage: [
    {
      value: 3,
      text: "交流220V",
      label: "交流220V",
      title: "交流220V"
    },
    {
      value: 4,
      text: "交流380V（含400V）",
      label: "交流380V（含400V）",
      title: "交流380V（含400V）"
    },
    {
      value: 5,
      text: "交流10kV",
      label: "交流10kV",
      title: "交流10kV"
    },
    {
      value: 6,
      text: "交流35kV",
      label: "交流35kV",
      title: "交流35kV"
    },
    {
      value: 7,
      text: "交流110kV",
      label: "交流110kV",
      title: "交流110kV"
    },
    {
      value: 8,
      text: "交流220kV",
      label: "交流220kV",
      title: "交流220kV"
    },
    {
      value: 9,
      text: "交流500kV",
      label: "交流500kV",
      title: "交流500kV"
    },
    {
      value: 1,
      text: "其它",
      label: "其它",
      title: "其它"
    },
    {
      value: 10,
      text: "交流1000kV",
      label: "交流1000kV",
      title: "交流1000kV"
    },
    {
      value: 2,
      text: "直流320kV",
      label: "直流320kV",
      title: "直流320kV"
    }
  ],
  open: [
    {
      value: 1,
      text: "是",
      label: "是",
      title: "是"
    },
    {
      value: 0,
      text: "否",
      label: "否",
      title: "否"
    }
  ]
});

export async function getAllDict() {
  const res = await http<any>({
    method: "get",
    url: "system/dict/query/all",
    data: {}
  });
  console.log(res);
  if (res.success) {
    allDict.value = res.data;
  }
}

export const cityList = ref([
  {
    id: "720001",
    name: "福州市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72653443440844800",
        name: "长乐市",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72653855757705216",
        name: "福清市",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72747400145412096",
        name: "闽侯县",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72748173239525376",
        name: "罗源县",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72751815371792384",
        name: "闽清县",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72752279228260352",
        name: "连江县",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72752485386690560",
        name: "永泰县",
        parentId: "720001",
        level: 3,
        childList: null
      },
      {
        id: "72752863343812608",
        name: "平潭县",
        parentId: "720001",
        level: 3,
        childList: null
      }
    ]
  },
  { id: "720002", name: "厦门市", parentId: "7200", level: 2, childList: [] },
  {
    id: "720003",
    name: "莆田市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72753447459364864",
        name: "仙游县",
        parentId: "720003",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720004",
    name: "泉州市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72753911315832832",
        name: "晋江市",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72754220553478144",
        name: "石狮市",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72754426711908352",
        name: "南安市",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72754753129422848",
        name: "永春县",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72754976467722240",
        name: "惠安县",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72755165446283264",
        name: "安溪县",
        parentId: "720004",
        level: 3,
        childList: null
      },
      {
        id: "72755405964451840",
        name: "德化县",
        parentId: "720004",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720005",
    name: "漳州市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72755972900134912",
        name: "龙海市",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72756247778041856",
        name: "长泰县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72756488296210432",
        name: "云霄县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72756660094902272",
        name: "诏安县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72756934972809216",
        name: "平和县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72757141131239424",
        name: "南靖县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72757364469538816",
        name: "漳浦县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72757553448099840",
        name: "华安县",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72757948585091072",
        name: "常山开发区",
        parentId: "720005",
        level: 3,
        childList: null
      },
      {
        id: "72758275002605568",
        name: "东山县",
        parentId: "720005",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720006",
    name: "龙岩市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72758652959727616",
        name: "新罗区",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72758876298027008",
        name: "武平县",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72759116816195584",
        name: "长汀县",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72759391694102528",
        name: "漳平市",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72759649392140288",
        name: "连城县",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72759889910308864",
        name: "上杭县",
        parentId: "720006",
        level: 3,
        childList: null
      },
      {
        id: "72760096068739072",
        name: "永定区",
        parentId: "720006",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720007",
    name: "三明市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72760611464814592",
        name: "永安市",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72760800443375616",
        name: "建宁县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72761109681020928",
        name: "将乐县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72761333019320320",
        name: "大田县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72761556357619712",
        name: "沙县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72761779695919104",
        name: "明溪县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72761951494610944",
        name: "宁化县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72762174832910336",
        name: "尤溪县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72762380991340544",
        name: "泰宁县",
        parentId: "720007",
        level: 3,
        childList: null
      },
      {
        id: "72762604329639936",
        name: "清流县",
        parentId: "720007",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720008",
    name: "南平市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72762999466631168",
        name: "邵武市",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72763239984799744",
        name: "武夷山市",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72763446143229952",
        name: "光泽县",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72763652301660160",
        name: "顺昌县",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72763858460090368",
        name: "建瓯市",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72764047438651392",
        name: "建阳区",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72764270776950784",
        name: "蒲城县",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72764476935380992",
        name: "政和县",
        parentId: "720008",
        level: 3,
        childList: null
      },
      {
        id: "72764700273680384",
        name: "松溪县",
        parentId: "720008",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "720009",
    name: "宁德市",
    parentId: "7200",
    level: 2,
    childList: [
      {
        id: "72765095410671616",
        name: "福安市",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72765284389232640",
        name: "福鼎市",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72765507727532032",
        name: "寿宁县",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72765920044392448",
        name: "柘荣县",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72766194922299392",
        name: "霞浦县",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72766418260598784",
        name: "屏南县",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72766675958636544",
        name: "周宁县",
        parentId: "720009",
        level: 3,
        childList: null
      },
      {
        id: "72766950836543488",
        name: "古田县",
        parentId: "720009",
        level: 3,
        childList: null
      }
    ]
  },
  {
    id: "241457306124951552",
    name: "其它",
    parentId: "7200",
    level: 2,
    childList: []
  }
]);
export async function getCityList() {
  const res = await http<[]>({
    method: "get",
    url: "system/organization/getCityList",
    data: {}
  });
  console.log(res);
  if (res.success) {
    cityList.value = res.data;
  }
}

//把最后一个children置为undefined和把数据加入到Map中
function setLastChildrenAndToMap(
  list: Array<ClassTypeEntity>,
  lineType: number
) {
  for (const classTypeEntity of list) {
    // console.log("隐患类型", type.children);
    if (Array.isArray(classTypeEntity.children)) {
      if (classTypeEntity.children.length == 0) {
        classTypeEntity.children = undefined;
        console.log("test================>", classTypeEntity);
      } else {
        setLastChildrenAndToMap(classTypeEntity.children, lineType);
      }
    }

    console.log("test================>1", classTypeEntity.formOptions);
    if (classTypeEntity.formOptions) {
      if (!classTypeEntity.dynamicFormOptions) {
        classTypeEntity.dynamicFormOptions = new Array<DynamicFormOption>();
      }
      for (const formOption of classTypeEntity.formOptions) {
        classTypeEntity.dynamicFormOptions?.push({
          isShow: true,
          lineType: lineType,
          title: formOption,
          isHideOldForm: true
        });
      }
      console.log("test================>2", classTypeEntity);
    }
  }
}
